app/Controllers/API/Usuarios.php

  public function create()
  {
    try {
      $usuarios = $this->request->getJSON();
      if ($this->model->insert($usuarios)):
---
INSERT INTO `USUARIOS` (`NOMBRE_USUARIO`, `EMAIL`, `CONTRASENIA`, `NOMBRE`, `APATERNO`, `AMATERNO`, `TELEFONO`, `ESTADO`, `CREADO_EN`, `ACTUALIZADO_EN`) VALUES ('gmedel', 'gmedel@ejemplo.cl', 'gem.1234', 'Gary', 'Medel', 'García', '000000000', 'INACTIVO', '2024-09-10 04:18:35', '2024-09-10 04:18:35')

  public function update($id = null)
  {
    try {
      if ($id == null)
        return $this->failValidationErrors('No se ha podido encontrar un Id válido');

      $usuarioVerificado = $this->model->find($id);
      if ($usuarioVerificado == null)
        return $this->failNotFound('No se ha encontrado el usuario con id: ' . $id);

      $usuario = $this->request->getJSON();

      if ($this->model->update($id, $usuario)):
---
UPDATE `USUARIOS` SET `NOMBRE_USUARIO` = 'CLOPEZ', `EMAIL` = 'usuario2@example.com', `CONTRASENIA` = 'password123', `NOMBRE` = 'Camila', `APATERNO` = 'López', `AMATERNO` = 'Hernández', `TELEFONO` = '966654321', `ESTADO` = 'BLOQUEADO', `ACTUALIZADO_EN` = '2024-09-10 04:51:56'
WHERE `USUARIOS`.`ID_USUARIO` IN ('22')